import avatar1 from '../img/person1/avatar/ava.jpg';
import avatar2 from '../img/person2/avatar/ava.jpg';

import slide1 from '../img/person1/portfolio/work1.jpg';
import slide2 from '../img/person1/portfolio/work2.jpg';
import slide3 from '../img/person1/portfolio/work3.jpg';
import slide4 from '../img/person1/portfolio/work4.jpg';
import slide5 from '../img/person1/portfolio/work5.jpg';
import slide6 from '../img/person1/portfolio/work6.jpg';

import slide7 from '../img/person2/portfolio/work1.jpg';
import slide8 from '../img/person2/portfolio/work2.jpg';
import slide9 from '../img/person2/portfolio/work3.jpg';
import slide10 from '../img/person2/portfolio/work4.jpg';
import slide11 from '../img/person2/portfolio/work5.jpg';
import slide12 from '../img/person2/portfolio/work6.jpg';

export default [
  {
    id: 1,
    name: 'Бакланаў Міхаіл Іванавіч',
    avatar: avatar1,
    occupation: 'Беларускі савецкі архітэктар. Заслужаны архітэктар Беларускай ССР.',
    birthDate: '13.01.1914',
    birthPlace: 'с.Ивановка, Украіна',
    deathDate: '23.01.1990',
    deathPlace: 'Мінск',
    locationsCoords: {
      lat: '48.2590267',
      lng: '37.4451505',
    },
    videoId: '7CsnFSbpUqE',
    activity: [
      {
        date: '13.01.1914',
        place: 'с.Ивановка',
        description: 'Нарадзіўся ў с.Ивановка Данецкай вобласці Украіны.',
      },
      {
        date: '1932-1940',
        place: 'Харкаў',
        description: 'Вучыўся ў Харкаўскім архітэктурна-будаўнічым тэхнікуме, а затым у Харкаўскім інжынерна-будаўнічым інстытуце',
      },
      {
        date: '1940-1944',
        place: 'Польшча',
        description: 'Быў прызваны ў армію, ваяваў з фашыстамі, два гады правёў у палоне, бег з палону, далучыўся да партызанаў.',
      },
      {
        date: '1944-1980',
        place: 'Мінск',
        description: 'На працягу 36 гадоў працаваў у Белдзяржпраекце. Прайшоў шлях ад радавога архітэктара да кіраўніка архітэктурна-канструктарскай майстэрні.',
      },
    ],
    works: [
      { image: slide1, description: 'Нацыянальны акадэмічны драматычны тэатр' },
      { image: slide2, description: 'Дзяржаўная карцінная галерэя БССР' },
      { image: slide3, description: 'Беларускі дзяржаўны аграрны тэхнічны універсітэт' },
      { image: slide4, description: 'Галоўны корпус Беларускага Дзяржаўнага універсітэта' },
      { image: slide5, description: 'Бібліятэчны корпус Беларускага політэхнічнага інстытута' },
      { image: slide6, description: 'Помнік Якубу Коласу ў в. Мікалаеўшчына Мінскай вобласці' }],
    listOfWorks: [
      {
        year: '1948-1950',
        work: 'Рэканструкцыя Нацыянальнага акадэмічнага драматычнага тэатра ім. М. Горкага ў Мінску ',
      },
      {
        year: '1954-1957',
        work: 'Дзяржаўная карцінная галерэя БССР, цяпер Нацыянальны мастацкі музей Рэспублікі Беларусь',
      },
      {
        year: '1960',
        work: 'Вучэбныя корпуса Беларускага інстытута механізацыі сельскай гаспадаркі, цяпер Беларускі дзяржаўны аграрны тэхнічны універсітэт',
      },
      {
        year: '1966',
        work: 'Галоўны корпус, корпус радыёфізікі і электронікі Беларускага Дзяржаўнага універсітэта',
      },
    ],
  },

  {
    id: 2,
    name: 'Воінаў Аляксандр Пятровіч',
    avatar: avatar2,
    occupation: 'Архітэктар, вучоны, член-карэспандэнт НАН Беларусі, заслужаны дзеяч мастацтваў БССР',
    birthDate: '03.12.1902 ',
    birthPlace: 'г.Колпино, Расія',
    deathDate: '1987/10/01',
    deathPlace: 'Мінск',
    locationsCoords: {
      lat: '59.7640792 ',
      lng: '30.5785257 ',
    },
    videoId: '-0-cwOtJv_s',
    activity: [
      {
        date: '03.12.1902 ',
        place: 'Колпіна',
        description: 'Нарадзіўся ў г. Колпіна пад Санкт-Пецярбургам',
      },
      {
        date: '1924-1929',
        place: 'Масква',
        description: 'Вучыўся на архітэктурным факультэце Маскоўскага вышэйшага мастацка-тэхнічнага інстытута.',
      },
      {
        date: '1930-1941',
        place: 'Мінск',
        description: 'Працаваў у Белдзяржпраекце, дырэктарам якога быў прызначаны, і кіраваў архітэктурнай майстэрні',
      },
      {
        date: '1941-1949',
        place: 'Мінск',
        description: 'Старшыня праўлення Саюза архітэктараў Беларускай ССР.',
      },
      {
        date: '1948-1973',
        place: 'Мінск',
        description: 'Загадчык кафедры архітэктуры, прафесар-кансультант Беларускага політэхнічнага інстытута',
      },
      {
        date: '1941-1949',
        place: 'Мінск',
        description: 'Старшыня праўлення Саюза архітэктараў Беларускай ССР.',
      },
    ],
    works: [
      { image: slide7, description: 'Жылыя дамы на вуліцы Маскоўскай г. Мінска' },
      { image: slide8, description: 'Гасцініца «Свіслач» у г. Мінску' },
      { image: slide9, description: 'Палац піянераў і школьнікаў' },
      { image: slide10, description: 'Тэатр юнага гледача, цяпер рэзідэнцыя Прэзідэнта' },
      { image: slide11, description: 'Будынак ЦК КПБ' },
      { image: slide12, description: 'Інстытут фізкультуры ў г. Мінску' }],
    listOfWorks: [
      {
        year: '1933-1940',
        work: 'Па праектах А.П. Воінава былі пабудаваны: гасцініца «Беларусь», Палац піянераў, будынак партыйных курсаў (Вышэйшая партыйная школа), жылы дом Беларускай ваеннай акругі, Інстытут фізкультуры ў Мінску, гасцініца «Днепр» і жылыя дамы на Першамайскай вуліцы ў г. Магілёве ',
      },
      {
        year: '1944-1950',
        work: 'Аднаўленне будынкаў, разбураных падчас вайны, праектаваннем будынкаў лечсануправления ў Мінску, аэравакзала, музея Я. Купалы, Прэзідыума АН БССР, тэатра юнага гледача',
      },
      {
        year: '1968',
        work: 'За праект Ленінскага праспекта (праспект Незалежнасці) г. Мінска А.П. Воінава прысуджана Дзяржаўная прэмія БССР',
      },
    ],
  },
];
